[
  {
    "NAME": "Datawrapper",
    "DATE_RELEASED": "3/15/2013",
    "DATE_UPDATED": "6/21/2015",
    "CURRENT_VERSION": "1.9.2",
    "DEV_NAME": "Journalism++",
    "HOME_URL": "https://datawrapper.de/",
    "GITHUB_URL": "https://github.com/datawrapper/datawrapper",
    "DOWNLOAD_URL": "-",
    "PRICING": "From €12",
    "FREE_OPTION": "Open source",
    "PLATFORM": "Web",
    "ORGANISATIONS": "The Washington Post,The Guardian,Vox,The Wall Street Journal",
    "DEV_EMAIL": "support@datawrapper.de",
    "DEV_DESC": "Datawrapper is a tool that enables anyone to create visualizations in seconds, without any programming skills.",
    "CATEGORY": "Charts,Maps",
    "TAGS": "map maker,interactive map, chartmaker",
    "APPLESTORE_URL": "",
    "GOOGLEPLAY_URL": "",
    "LOGO_URL": "https://datawrapper.de/static/plugins/jpp-branding/abzv-logo.png",
    "CURATED_LIST": "Times,Data, beginner_list",
    "JT_WHAT": "Web-based tool for creating data visualisations.",
    "JT_WHY": "Emphasising efficiency over customisability, Datawrapper is one of the most popular tools for creating embeddable data visualisations. Simply upload your data, select a chart type, make any desired customisations, then publish.",
    "PRIORITY_LEVEL": "high",
    "NOTES": "",
    "REVIEW_DESC": "A tool for turning your data into mobile-responsive charts. Datawrapper requires no coding: upload CSVs or copy-paste from Excel and play around with different chart types and styling. Similar free tools include Plot.ly, Chartbuilder and Charted, all of which give you more control over export options than Datawrapper’s free plan. \n\nIf you’re looking to make this your newsroom’s primary charting tool, you can pay for the Team plan, which archives your charts for €129/month, customizes your own unique style for €279/month and gives you additional zooming functionality on maps for €349/month. An alternative would be configuring an open-source tool like Chartbuilder, which lets you customize styles across different chart types for free. You’ll lose the mapping functionality and the archives, but you’ll get the other benefits of the Team plan while saving at least €1500 a year.",
    "REVIEW_DOC": "You can check out Datawrapper’s GitHub page for extra explanation on formatting charts, but the user interface is pretty self-explanatory.",
    "REVIEW_TUT": "http://docs.datawrapper.de/tutorial/",
    "REVIEW_CUST": "Minimal, although you get more control at the higher price plans. You don’t get control over color or font styling, making it difficult to customize for your newsroom unless you opt for the Team plan.",
    "REVIEW_INST": "None — use the tool in your web browser."
  },
  {
    "NAME": "Flot",
    "DATE_RELEASED": "-",
    "DATE_UPDATED": "-",
    "CURRENT_VERSION": "-",
    "DEV_NAME": "David Schnur",
    "HOME_URL": "http://www.flotcharts.org/",
    "GITHUB_URL": "https://github.com/flot/flot",
    "DOWNLOAD_URL": "",
    "PRICING": "",
    "FREE_OPTION": "Open source",
    "PLATFORM": "Win, Mac, Linux",
    "ORGANISATIONS": "BBC",
    "DEV_EMAIL": "https://github.com/dnschnur",
    "DEV_DESC": "Flot is a pure JavaScript plotting library for jQuery, with a focus on simple usage, attractive looks and interactive features.",
    "CATEGORY": "Charts",
    "TAGS": "",
    "APPLESTORE_URL": "",
    "GOOGLEPLAY_URL": "",
    "LOGO_URL": "http://www.flotcharts.org/images/header.png",
    "CURATED_LIST": "BBC_list",
    "JT_WHAT": "JavaScript graph plotting for jQuery",
    "JT_WHY": "It helped us build WAT (http://wat.bbcnewslabs.co.uk)",
    "PRIORITY_LEVEL": "high",
    "NOTES": "",
    "REVIEW_DESC": "A JavaScript charting library for jQuery. Off-the-shelf, Flot supports line, bar, point and filled area charts, but the tool’s plugins give you access to a wider range of graph types. Its well-documented tutorials put Flot on par with Google Charts in terms of accessibility for entry-level coders, but it’s still going to come with a learning curve for first-time JavaScript users.",
    "REVIEW_DOC": "Thorough. Start with the Usage Wiki and Example pages on the Flot website and GitHub repositories to get a sense of the different types of projects Flot can support. If you’re new to JavaScript, head to jqueryflottutorial.com for code walk-throughs and tutorials. The developers recommend getting to know the library by downloading example code rather than turning to the API documentation, but using the two hand-in-hand will probably give you a better sense of how to customize your charts. And if you want more Flot, you can always join the community help forum, explore its plugin repository or check out its blog.",
    "REVIEW_TUT": "http://www.jqueryflottutorial.com/",
    "REVIEW_CUST": "Flot comes with an expanding plugin repository, which lets you add more functionality to the core library.",
    "REVIEW_INST": "None — just download the JavaScript file and add it to your site directory. You’ll also need jQuery loaded on your page, which you can either download to your site directory or link to using its CDN (cloud delivery network)."
  },
  {
    "NAME": "Leaflet JS",
    "DATE_RELEASED": "5/16/2011",
    "DATE_UPDATED": "7/14/2015",
    "CURRENT_VERSION": 0.7,
    "DEV_NAME": "Vladimir Agafonkin",
    "HOME_URL": "http://leafletjs.com/",
    "GITHUB_URL": "https://github.com/Leaflet/Leaflet",
    "DOWNLOAD_URL": "",
    "PRICING": "-",
    "FREE_OPTION": "Open source",
    "PLATFORM": "Win,Mac,Linux",
    "ORGANISATIONS": "The Times, The Sunday Times",
    "DEV_EMAIL": "",
    "DEV_DESC": "Leaflet is the leading open-source JavaScript library for mobile-friendly interactive maps. Weighing just about 33 KB of JS, it has all the mapping features most developers ever need.Leaflet is designed with simplicity, performance and usability in mind. It works efficiently across all major desktop and mobile platforms, can be extended with lots of plugins, has a beautiful, easy to use and well-documented API and a simple, readable source code that is a joy to contribute to.",
    "CATEGORY": "Maps",
    "TAGS": "data vis, data visualisations",
    "APPLESTORE_URL": "",
    "GOOGLEPLAY_URL": "",
    "LOGO_URL": "http://leafletjs.com/docs/images/logo.png",
    "CURATED_LIST": "Times",
    "JT_WHAT": "Open source JavaScript library to create mobile-friendly, interactive maps.",
    "JT_WHY": "More functionality and features than google fusion tables.",
    "PRIORITY_LEVEL": "high",
    "NOTES": "",
    "REVIEW_DESC": "A JavaScript library for creating lightweight interactive “slippy” maps. It’s commonly used for choropleths, but its off-the-shelf functionality also includes adding marker layers, shapes and overlays, styling pop-ups and enabling user control like zooming and panning. An extensive plugin library provides additional functionality for more customized mapping projects. \n\nLeaflet is a great tool for a soft entry into mapping with JavaScript, but if you’re a non-coder looking for a quick visualisation, better to check out Fusion Tables or BatchGeo. If you’ve worked with JavaScript before, leave yourself some time to check out the plugins, especially for more involved mapping projects.",
    "REVIEW_DOC": "Leaflet’s site has a one-stop destination for its extensive API documentation. Entry-level coders are better off starting with one of the many tutorials before visiting this page, which assumes an understanding of how JavaScript methods, events and objects work. If you’re stuck, you can also join the Leaflet.js Google Group and give a shout to its community of users.",
    "REVIEW_TUT": "http://leafletjs.com/examples.html",
    "REVIEW_CUST": "Leaflet can be easily extended with over 100 plugins created by its developer community. Favourites include Omnivore, which lets you use data in formats other than geoJson to drive your projects; Providers, which lets you add map tiles from various sources; and Marker-Clustering, which groups nearby points. Since you provide your own base maps, the design can look as original as the tiles you pull into your project.",
    "REVIEW_INST": "You can either download Leaflet to your site directory, include the CDN link in your page’s header, or build from the source files using Node.js."
  },
  {
    "NAME": "TimelineJS",
    "DATE_RELEASED": "8/27/2012",
    "DATE_UPDATED": "7/8/2015",
    "CURRENT_VERSION": "2.36.0",
    "DEV_NAME": "Scott Bradley,Zach Wise,Northwestern University Knight Lab",
    "HOME_URL": "http://timeline.knightlab.com/",
    "GITHUB_URL": "https://github.com/NUKnightLab/TimelineJS",
    "DOWNLOAD_URL": "-",
    "PRICING": "-",
    "FREE_OPTION": "Open source",
    "PLATFORM": "Win,Mac,Linux",
    "ORGANISATIONS": "Northwestern University Knight Lab,Le Monde,Time Magazine",
    "DEV_EMAIL": "knightlab@northwestern.edu",
    "DEV_DESC": "TimelineJS is an open-source tool that enables you to build visually-rich interactive timelines and is available in 40 languages.",
    "CATEGORY": "",
    "TAGS": "",
    "APPLESTORE_URL": "",
    "GOOGLEPLAY_URL": "",
    "LOGO_URL": "-",
    "CURATED_LIST": "Times, beginner_list",
    "JT_WHAT": "A tool for building media-rich interactive timelines",
    "JT_WHY": "The most popular timeline creator for journalists, it allows for a plethora of content sources, from maps, tweets to videos.",
    "PRIORITY_LEVEL": "high",
    "NOTES": "",
    "REVIEW_DESC": "A tool for creating interactive multimedia timelines. Build your project entirely from a Google Sheets template and add the embed code to your HTML — no other coding required. \n\nThere’s not another timeline tool that gives journalists the same functionality for the same ease of use. It supports the full gauntlet of media formats, from SoundCloud to Vine to Google Maps, and styling the timeline itself is set entirely by the dates you input into the spreadsheet. Just be careful when trying to integrate with Wordpress: you’ll have to install some plugins to get around compatibility issues.",
    "REVIEW_DOC": "Timeline gets detailed treatment on its site, where there’s documentation on spreadsheet and JSON formatting, CSS selectors and JavaScript configuration.",
    "REVIEW_TUT": "https://vimeo.com/143407878",
    "REVIEW_CUST": "Because Timeline’s spreadsheet template supports markdown, you can do a lot of in-line text formatting right in your slide cell, and the range of file formats supported means there’s a large degree of flexibility in media choice. If you want to add your own CSS, you’ll have to configure your project in JavaScript and give the documentation on the tool’s CSS selectors a read. However, Timeline looks like Timeline: it would take a Herculean effort to design it to look like it’s an in-house tool.",
    "REVIEW_INST": "None."
  },
  {
    "NAME": "ArchieML",
    "DATE_RELEASED": "-",
    "DATE_UPDATED": "-",
    "CURRENT_VERSION": "-",
    "DEV_NAME": "Michael Strickland, Archie Tse, Matthew Ericson and Tom Giratikanon / The New York Times",
    "HOME_URL": "http://archieml.org/",
    "GITHUB_URL": "",
    "DOWNLOAD_URL": "",
    "PRICING": "",
    "FREE_OPTION": "Open source",
    "PLATFORM": "Win, Mac, Linux",
    "ORGANISATIONS": "BBC",
    "DEV_EMAIL": "michael.strickland@nytimes.com",
    "DEV_DESC": "ArchieML (or \"AML\") was created at The New York Times to make it easier to write and edit structured text on deadline that could be rendered in web pages, or more specifically, rendered in interactive graphics. One of the main goals was to make it easy to tag text as data, without having type a lot of special characters. Another goal was to allow the document to contain lots of notes and draft text that would not be read into the data. And finally, because we make extensive use of Google Documents's concurrent-editing features — while working on a graphic, we can have several reporters, editors and developers all pouring information into a single document — we wanted to have a format that could survive being edited by users who may never have seen ArchieML or any other markup language at all before.",
    "CATEGORY": "Data processing",
    "TAGS": "",
    "APPLESTORE_URL": "",
    "GOOGLEPLAY_URL": "",
    "LOGO_URL": "http://archieml.org/assets/archieml-tri.png",
    "CURATED_LIST": "BBC_list",
    "JT_WHAT": "A way of structuring text without giving up human readability",
    "JT_WHY": "It lets technical and non-technical colleagues contribute and edit content, quickly, without requiring a massive content management system.",
    "PRIORITY_LEVEL": "high",
    "NOTES": "",
    "REVIEW_DESC": "A tool for turning structured text into web pages or interactive visualizations. Archie Markup Language, or ArchieML, is designed to be easy for non-developers to use: the whole idea is to increase efficiency by allowing copy editors, writers and graphic designers to collaborate on the same project, at the same time. Journalists can tag text using key-value pairs without having to learn the intricacies of YAML or JSON syntax, which rely on special spacings and brackets to be renderable. All tagging is done with colons, and ArchieML ignores text that isn’t tagged, meaning that you can save lots of additional information on a document that won’t interfere with the construction of your page or visual.",
    "REVIEW_DOC": "ArchieML comes with thorough setup instructions, as well as interactive demos for turning syntax into JSON data. You can also try it out for yourself in a Sandbox on the tool’s website.",
    "REVIEW_TUT": "http://archieml.org/#demo",
    "REVIEW_CUST": "Essentially infinite. The whole point of ArchieML is that it turns feather-bare markup into objects that can be manipulated into layouts and graphics templates. There are parsers and setup instructions available for the more popular coding languages, you can render your data using your preferred programming language.",
    "REVIEW_INST": "To get ArchieML from your documents and into web pages, you’ll have to set up a parser. Pre-existing parsers for JavaScript, Ruby, R, Python and Clojure can be found on the ArchieML website. Integrating the tool with Google Docs requires a bit more setup, but there’s well-documented example code in the tool’s GitHub repository."
  }
]
